<template>
  <svg
    width="18"
    height="18"
    viewBox="0 0 18 18"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    :class="`quality-level-${quality}`"
  >
    <path
      d="M0 12.858C0 12.1479 0.575634 11.5723 1.28571 11.5723C1.99579 11.5723 2.57143 12.1479 2.57143 12.858V15.4294C2.57143 16.1395 1.99579 16.7151 1.28571 16.7151C0.575634 16.7151 0 16.1395 0 15.4294V12.858Z"
      fill="white"
    ></path>
    <path
      d="M5.14258 10.2857C5.14258 9.57563 5.71821 9 6.42829 9C7.13837 9 7.71401 9.57563 7.71401 10.2857V15.4286C7.71401 16.1386 7.13837 16.7143 6.42829 16.7143C5.71821 16.7143 5.14258 16.1387 5.14258 15.4286V10.2857Z"
      fill="white"
    ></path>
    <path
      d="M10.2861 6.42927C10.2861 5.71919 10.8618 5.14355 11.5718 5.14355C12.2819 5.14355 12.8576 5.71919 12.8576 6.42927V15.4293C12.8576 16.1393 12.2819 16.715 11.5718 16.715C10.8618 16.715 10.2861 16.1393 10.2861 15.4293V6.42927Z"
      fill="white"
    ></path>
    <path
      d="M15.4287 2.57185C15.4287 1.86177 16.0043 1.28613 16.7144 1.28613C17.4245 1.28613 18.0001 1.86177 18.0001 2.57185V15.429C18.0001 16.1391 17.4245 16.7147 16.7144 16.7147C16.0043 16.7147 15.4287 16.1391 15.4287 15.429V2.57185Z"
      fill="white"
    ></path>
  </svg>
</template>

<script setup>
const props = defineProps({
  quality: {
    type: Number,
    default: 1
  }
})
</script>

<style>
.quality-level-1 path:nth-child(n + 2) {
  /* Р’СЃРµ РїР°Р»РѕС‡РєРё, РєСЂРѕРјРµ РїРµСЂРІРѕР№ */
  opacity: 0.2;
}

.quality-level-2 path:nth-child(n + 3) {
  /* Р’СЃРµ РїР°Р»РѕС‡РєРё, РєСЂРѕРјРµ РїРµСЂРІС‹С… РґРІСѓС… */
  opacity: 0.2;
}

.quality-level-3 path:nth-child(4) {
  /* РўРѕР»СЊРєРѕ С‡РµС‚РІРµСЂС‚Р°СЏ РїР°Р»РѕС‡РєР° */
  opacity: 0.2;
}

.quality-level-4 path {
  /* Р’СЃРµ РїР°Р»РѕС‡РєРё РїРѕР»РЅРѕСЃС‚СЊСЋ РІРёРґРёРјС‹ */
  opacity: 1;
}
</style>
